luojia65/w806-pac/w806.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>Beijing Lianshengde Micro-electronics Co., Ltd.</vendor>
  <name>W806</name>
  <version>1.0</version>
  <description>W806 general purpose microcontroller</description>
  <licenseText>
    Copyright (c) 2021 Rustcc Embedded Wechat Group
    W806-SVD is licensed under Mulan PSL v2.
    You can use this software according to the terms and conditions of the Mulan PSL v2.
    You may obtain a copy of Mulan PSL v2 at:
            http://license.coscl.org.cn/MulanPSL2
    THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
    EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
    MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
    See the Mulan PSL v2 for more details.
  </licenseText>
  
  <addressUnitBits>8</addressUnitBits> <!-- byte addressable -->
  <width>32</width>
  <size>32</size>
  <access>read-write</access>

  <peripherals>
    <peripheral>
      <name>DMA</name>
      <baseAddress>0x40000800</baseAddress>
      <description>Direct memory access module</description>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PMU</name>
      <baseAddress>0x40000D00</baseAddress>
      <description>Power management unit</description>
      <registers>
        <register>
          <name>todo</name>
          <description>??</description>
          <addressOffset>0</addressOffset>
          <fields>
            <!-- todo: fields -->
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>System clock and reset controller</description>
      <baseAddress>0x40000E00</baseAddress>
      <registers>
        <register>
          <name>clock_enable</name>
          <description>Software configure clock gate enable\n\n
          By configuring this clock gating enable register, you can control the clock to shutdown 
          a specified function, so as to achieve the purpose of shutting down a certain module.\n\n
          In order to provide the firmware with flexibility to control the power consumption of the system, 
          the clock and reset module provides the clock gating function of each module in the system. 
          When the clock of the corresponding module is turned off, the digital logic and clock tree of the module
          will stop working, which can reduce the dynamic power consumption of the system. 
          </description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007fff</resetValue>
          <resetMask>0x00007fff</resetMask>
          <fields>
            <field>
              <name>touch</name>
              <description>Touch sensor module clock gate enable\n\n
              By default, touch sensor module clock gate is enabled.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ClockGate</name>
                <enumeratedValue>
                    <name>disable</name>
                    <description>The clock gate is turned off.</description>
                    <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                    <name>enable</name>
                    <description>The clock gate is ruened on.</description>
                    <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- no bluetooth clock (offset 20) w806 -->
            <!-- todo: verify qsram (offset 19) -->
            <field>
              <name>sdio</name>
              <description>Secure digital input/output clock gate enable\n\n
              By default, SDIO master module clock gate is enabled.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <!-- todo: verify gpsec (offset 17) -->
            <field>
              <name>rsa</name>
              <description>RSA Montgomery coprocessor clock gate enable\n\n
              By default, RSA clock gate is enabled.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <field>
              <name>i2s</name>
              <description>Inter-Integrated Sound clock gate enable\n\n
              By default, I2S clock gate is enabled.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <!-- todo: verify lcd (offset 14) -->
            <field>
              <name>pwm</name>
              <description>Pulse-width modulation module clock gate enable\n\n
              By default, PWM clock gate is enabled.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <field>
              <name>adc</name>
              <description>Analog-digital converter clock gate enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <field>
              <name>gpio</name>
              <description>General purpose input/output clock gate enable\n\n
              By default, GPIO clock gate is enabled.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <field>
              <name>timer</name>
              <description>Timer module clock gate enable\n\n
              By default, timer clock gate is enabled.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <!-- no rf clock (offset 9) on w806 -->
            <field>
              <name>dma</name>
              <description>Direct memory access clock gate enable\n\n
              By default, DMA clock gate is enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <!-- todo: verify lspi (offset 7) -->
            <field>
              <name>uart%s</name>
              <description>Universal asynchronous transmitter/receiver enable\n\n
              By default, UART clock gate is enabled.</description>
              <bitRange>[1:1]</bitRange>
              <dim>6</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
            <field>
              <name>i2c</name>
              <description>Inter-Integrated Circuit module enable\n\n
              By default, I2C clock gate is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGate" />
            </field>
          </fields>
        </register>
        <register>
          <name>adapt_mask</name>
          <description>Adaptive clock configuration mask\n\n
          The chip adaptively turns off the clock of some functional modules according to 
          the transition of some internal states.\n\n
          Please do not change the configuration, otherwise it may cause system abnormality 
          when configuring PMU function.</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000007e</resetValue>
          <resetMask>0x0000007f</resetMask>
          <fields>
            <field>
              <name>cpu</name>
              <description>Cpu domain allow adaptive clock configurations\n\n
              Indicates whether the clock supplied to the CPU clock domain (including CPU, bus1, ROM, SRAM) 
              can be turned off adaptively.\n\n
              When the CPU needs to enter the WFI state, do not set the adaptive shutdown.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ClockGateMask</name>
                <enumeratedValue>
                    <name>allow</name>
                    <description>Allow adaptive shutdown and opening.</description>
                    <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                    <name>disallow</name>
                    <description>Disallow adaptive shutdown and opening.</description>
                    <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- bits [5:2]: reserved for internal use, do not modify -->
            <field>
              <name>sdio_ahb</name>
              <description>Sdio-Ahb domain allow adaptive clock configurations\n\n
              Indicates whether the clock supplied to the sdio ahb clock domain can be turned off adaptively.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGateMask" />
            </field>
            <field>
              <name>pmu</name>
              <description>Allow pmu to shutdown gate unit connected to pll output\n\n
              After the clock output by PLL, there is a gate control unit. 
              This register configuration is used to indicate whether this unit is allowed to be shut down by the PMU.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ClockGateMask" />
            </field>
          </fields>
        </register>
        <!-- offset 0x0008: reserved -->
        <register>
          <name>reset_control</name>
          <description>Software module reset control\n\n
          The chip provides the soft reset function of each subsystem, 
          and the subsystem reset can be achieved by setting the corresponding bit of this register to 0. 
          However, the reset state will not be automatically cleared. 
          To restore normal operation, the corresponding bit of this register must be set to 1.\n\n
          The soft reset function does not reset the CPU and watchdog.
          In this register, the reset operation of APB, BUS1 and BUS2 (corresponding to APB bus, system bus and data bus) 
          is not recommended, which will cause system access device abnormality.
          </description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue> <!-- Todo: the manual says it's 0x01ffffff, check -->
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>touch</name>
              <description>Touch sensor module reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ResetControl</name>
                <enumeratedValue>
                    <name>reset</name>
                    <description>Reset the corresponding peripheral.</description>
                    <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                    <name>release</name>
                    <description>Release the reset state the corresponding peripheral.</description>
                    <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>flash</name>
              <description>Flash controller module reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <!-- no bt reset (offset 29) on w806 -->
            <!-- todo: verify qspi (offset 28) -->
            <!-- todo: verify sdio master (offset 27) -->
            <!-- todo: verify gpsec (offset 26) -->
            <field>
              <name>rsa</name>
              <description>RSA Montgomery coprocessor module reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <field>
              <name>i2s</name>
              <description>Inter-Integrated Sound module reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <!-- todo: verify lcd (offset 23) -->
            <field>
              <name>pwm</name>
              <description>Pulse-width modulation module reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <field>
              <name>adc</name>
              <description>Sar-adc module reset</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <field>
              <name>timer</name>
              <description>Timer module reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <field>
              <name>gpio</name>
              <description>Gpio module reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <!-- no rf reset (offset 18) on w806 -->
            <!-- todo: verify spis (offset 17) -->
            <!-- todo: verify spim (offset 16) -->
            <field>
              <name>uart%s</name>
              <description>Universal asynchronous transmitter/receiver reset</description>
              <bitRange>[10:10]</bitRange>
              <dim>6</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <field>
              <name>i2c</name>
              <description>Inter-Integrated Circuit module reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <field>
              <name>bus%s</name>
              <description>Internal bus reset</description>
              <bitRange>[7:7]</bitRange>
              <dim>2</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <field>
              <name>apb</name>
              <description>APB bridge module reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <!-- rst mem mng (offset 5) is reserved for internal use, do not modify -->
            <field>
              <name>dma</name>
              <description>Direct memory access module reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <field>
              <name>sdio_ahb</name>
              <description>Sdio-Ahb clock domain reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ResetControl" />
            </field>
            <!-- rst sec (offset 2) is reserved for internal use, do not modify -->
            <!-- rst mac (offset 1) is reserved for internal use, do not modify -->
            <!-- rst bbp (offset 0) is reserved for internal use, do not modify -->
          </fields>
        </register>
        <register>
          <name>clock_divide</name>
          <description>Software clock division configuration\n\n
          </description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <resetValue>0x03020306</resetValue>  <!-- Todo: the manual says it's 0x00002212, check -->
          <resetMask>0x8fffffff</resetMask>
          <fields>
            <field>
              <name>frequency</name>
              <description>Divide frequency enable\n\n
              When you need to reconfigure cpu_clk_divider, wlan_clk_divider, bus2_syncdn_factor,
              sdadc_fdiv, set this register, the hardware will automatically update the 
              above four parameters to the divider, and then clear this register. 
              </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>in_effect</name>
                  <description>Frequency division factor has taken effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>update</name>
                  <description>Request hardware to update frequency division parameters.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- bits [30:28] are reserved -->
            <field>
              <name>peripheral</name>
              <description>160-MHz clock divide factor</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>bus2_sync</name>
              <description>Ratio between bus1 and bus2 clock frequency</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>wlan</name>
              <description>PLL to WLAN system divide factor\n\n
              After dividing the frequency of the clock from the PLL, it is sent to the wlan system. 
              This register is the frequency division factor, the factor should be >= 2.\n\n</description>
              <!-- The default frequency division factor is 3, that is, the 480MHz output of pll is divided by 3 to obtain a 160MHz clock,
              which is used as the root node clock (wlan continues to divide the frequency to obtain a more detailed low-frequency clock);\n\n
              Note 1: For the WLAN system to work normally, this clock needs to be fixed at 160MHz; if the WLAN system is turned off,
              Then this clock can be reduced in frequency to save power consumption. This clock must not be configured higher than 160MHz.\n\n
              Note 2: The secondary bus clock and APB clock are divided by four for this clock.</description> -->
              <bitRange>[15:8]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>2</minimum>
                  <maximum>255</maximum> <!-- todo: manual did not define any maximum value -->
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>cpu</name>
              <description>PLL to CPU clock divide factor</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
